Autodesk.Revit.DB.Structure.EndTreatmentType.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new EndTreatmentType in the specified document and adds the input string to the endTreatment parameter.
doc:
Returns the newly created EndTreatmentType in the specified document.
treatment:
This string will be se to the endTreatment parameter.
Returns:
Returns the newly created EndTreatmentType in the specified document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Structure.EndTreatmentType.Create(Autodesk.Revit.DB.Document)
Creates a new EndTreatmentType in the specified document.
doc:
A Document.
Returns:
Returns the newly created EndTreatmentType in the specified document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017